; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v8 - type_3 ?v7 - type_2)
 	      (pred_3 ?v3 - object ?v7 - type_2)
	      (pred_2 ?v8 - type_3 ?v1 - type_1)
	      (pred_1 ?v8 - type_3 ?v3 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v8 - type_3 ?v2 ?v5 - type_2)
       :precondition (and  (pred_4 ?v8 ?v2))
       :effect (and  (pred_4 ?v8 ?v5)
		     (not (pred_4 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_3 ?v6 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_4 ?v8 ?v4) (pred_2 ?v8 ?v1))
       :effect (and (pred_1 ?v8 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_2 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_3 ?v6 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v6 ?v1) (pred_4 ?v8 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_2 ?v8 ?v1)
		    (not (pred_1 ?v8 ?v6 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_01 obj_03 - type_1
obj_08 obj_02 obj_04 - type_2
obj_05 obj_09 obj_06 - object)
(:init
(pred_4 obj_07 obj_02)
(pred_2 obj_07 obj_01)
(pred_2 obj_07 obj_03)
(pred_3 obj_05 obj_02)
(pred_3 obj_09 obj_08)
(pred_3 obj_06 obj_04)
)
(:goal
(and
(pred_3 obj_05 obj_02)
(pred_3 obj_09 obj_08)
(pred_3 obj_06 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_07 ?b obj_03))))
)
)

; plan
1. (op_2 obj_07 obj_02 obj_04)
   deleted: (pred_4 obj_07 obj_02)
   added: (pred_4 obj_07 obj_04)
   goals met: 2 of 3
2. (op_3 obj_07 obj_06 obj_04 obj_01)
   deleted: (pred_3 obj_06 obj_04) (pred_2 obj_07 obj_01)
   added: (pred_1 obj_07 obj_06 obj_01)
   goals met: 2 of 3
3. (op_2 obj_07 obj_04 obj_02)
   deleted: (pred_4 obj_07 obj_04)
   added: (pred_4 obj_07 obj_02)
   goals met: 2 of 3
4. (op_1 obj_07 obj_06 obj_02 obj_01)
   deleted: (pred_1 obj_07 obj_06 obj_01)
   added: (pred_3 obj_06 obj_02) (pred_2 obj_07 obj_01)
   goals met: 3 of 3
